adpyke.codesnap
akamud.vscode-theme-onedark
blackboxapp.blackbox
blackboxapp.blackboxagent
bmewburn.vscode-intelephense-client
brapifra.phpserver
dart-code.dart-code
dart-code.flutter
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.code-runner
github.copilot
github.copilot-chat
inferrinizzard.prettier-sql-vscode
jebbs.plantuml
mechatroner.rainbow-csv
mehedidracula.php-namespace-resolver
ms-dotnettools.vscode-dotnet-runtime
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vsliveshare.vsliveshare
mtxr.sqltools
oracle.sql-developer
rdebugger.r-debugger
redhat.java
redhat.vscode-xml
reditorsupport.r
reditorsupport.r-syntax
ritwickdey.liveserver
ryannaddy.laravel-artisan
techer.open-in-browser
vmware.vscode-boot-dev-pack
vmware.vscode-spring-boot
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-java-upgrade
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
vscode-icons-team.vscode-icons
zignd.html-css-class-completion
